# vim: ft=ruby
brew 'ack'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'git'
brew 'htop', args: ['with-ncurses']
brew 'less'
brew 'neovim'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'shellcheck'
brew 'tmux'
brew 'watch'
brew 'zsh'

tap 'homebrew/cask'
cask 'hammerspoon'
cask 'karabiner-elements'

tap 'homebrew/cask-versions'
cask 'iterm2-beta'

tap 'buo/cask-upgrade'
