# vim: ft=ruby
brew 'ack'
brew 'bash'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'git'
brew 'htop', args: ['with-ncurses']
brew 'less'
brew 'neovim'
brew 'shellcheck'
brew 'watch'

tap 'homebrew/completions'
brew 'bash-completion@2'
brew 'bundler-completion'
brew 'gem-completion'
brew 'pip-completion'
brew 'rails-completion'
brew 'rake-completion'
brew 'ruby-completion'
brew 'spring-completion'

tap 'caskroom/cask'
cask 'hammerspoon'
cask 'karabiner-elements'

tap 'caskroom/versions'
cask 'iterm2-beta'

tap 'caskroom/fonts'
cask 'font-hack-nerd-font'

tap 'buo/cask-upgrade'
